#include <cstdio>
const int N=10000, Md=10007;
int f[2], g[2];//滚动数组 
int main(){
    freopen("even.in","r",stdin);
    freopen("even.out","w",stdout);
    int t, n;
    scanf("%d", &t);
	while (t--){ 
		scanf("%d", &n);
    	f[1]=8; g[1]=1;
	    for (int i=2; i<=n; i++){
    	    f[i%2]=(9*f[(i-1)%2]+g[(i-1)%2])%Md;
        	g[i%2]=(9*g[(i-1)%2]+f[(i-1)%2])%Md;
    	}
    	printf("%d\n", f[n%2]);
	}
    return 0;
}
//设f[i]为i位数中，含有偶数个5的数的个数
//而g[i]为i位数中，含有奇数个5的数的个数
//在偶数个5的i位数之后添加1个（非5），会得到i+1位数（偶数个5） 
//                    添加1个（5），会得到i+1位数（奇数个5） 
//在奇数个5的i位数之后添加1个（非5），会得到i+1位数（奇数个5） 
//                    添加1个（5），会得到i+1位数（偶数个5） 
//递推公式：    f[1]=8,  g[1]=1
//              f[i+1]=9*f[i]+g[i] 
//              g[i+1]=f[i]+9*g[i]
//
//int f[1000000], g[1000000]; 
//    f[i+1]=(9*f[i]+g[i])%Md;
//    g[i+1]=(f[i]+9*g[i])%Md;
//把这段程序修改成滚动数组 

//   123    0个5 
//   123 0,1,2,3,...,9
//    1230  1231  1232   1239   1235
